module lnrv_idu_rv32
(
    input[31 : 0]                       ir,

    output[4 : 0]                       dec_rs1,
    output[4 : 0]                       dec_rs2,
    output[4 : 0]                       dec_rd,
    output[11 : 0]                      dec_csr,
    output[31 : 0]                      dec_imm,

    // 送给分支预测模块
    output                              dec_ir_bxx,
    output                              dec_ir_jal,
    output                              dec_ir_jalr,
    output                              dec_ir_fence,
    output[31 : 0]                      dec_imm_jal,
    output[31 : 0]                      dec_imm_jalr,
    output[31 : 0]                      dec_imm_bxx,
    output                              dec_rs1_x1,

    input                               d_mode,

    // 非法指令
    output                              dec_ilegl_ir,

    output[`DEC_OP_BUS_WIDTH - 1 : 0]   dec_op_bus,
    output[`DEC_OP_TYPE_WIDTH -1 : 0]   dec_op_type
);

wire[6 : 0]                         opcode;
wire                                opcode_is_0110111;
wire                                opcode_is_0010111;
wire                                opcode_is_1101111;
wire                                opcode_is_1100111;
wire                                opcode_is_1100011;
wire                                opcode_is_0000011;
wire                                opcode_is_0100011;
wire                                opcode_is_0010011;
wire                                opcode_is_0110011;
wire                                opcode_is_0001111;
wire                                opcode_is_1110011;
wire                                opcode_is_0101111;
wire                                opcode_is_1111111;
wire                                opcode_is_0000000;


wire[2 : 0]                         funct3;
wire                                funct3_is_000;
wire                                funct3_is_001;
wire                                funct3_is_010;
wire                                funct3_is_011;
wire                                funct3_is_100;
wire                                funct3_is_101;
wire                                funct3_is_110;
wire                                funct3_is_111;
wire                                funct3_bit_2_is_1;
wire                                funct3_bit_2_is_0;
wire                                funct3_bit_1_is_1;
wire                                funct3_bit_1_is_0;
wire                                funct3_bit_0_is_1;
wire                                funct3_bit_0_is_0;

wire[6 : 0]                         funct7;
wire                                funct7_is_0000000;
wire                                funct7_is_0100000;
wire                                funct7_is_0000001;
wire                                funct7_is_0001000;
wire                                funct7_is_1111111;

// 指令类型
wire                                instr_u_type;
wire                                instr_i_type;
wire                                instr_s_type;
wire                                instr_b_type;
wire                                instr_j_type;
wire                                instr_r_type;

// 具体指令
// 常规指令
wire                                instr_add;
wire                                instr_addi;
wire                                instr_and;
wire                                instr_andi;
wire                                instr_auipc;
wire                                instr_or;
wire                                instr_ori;
wire                                instr_xor;
wire                                instr_xori;
wire                                instr_sll;
wire                                instr_slli;
wire                                instr_slt;
wire                                instr_slti;
wire                                instr_sltiu;
wire                                instr_sltu;
wire                                instr_sra;
wire                                instr_srai;
wire                                instr_srl;
wire                                instr_srli;
wire                                instr_sub;
wire                                instr_lui;

// csr相关指令
wire                                instr_csrrc;
wire                                instr_csrrci;
wire                                instr_csrrw;
wire                                instr_csrrwi;
wire                                instr_csrrs;
wire                                instr_csrrsi;

// 分支相关指令
wire                                instr_beq;
wire                                instr_bge;
wire                                instr_bgeu;
wire                                instr_blt;
wire                                instr_bltu;
wire                                instr_bne;
wire                                instr_jal;
wire                                instr_jalr;

// 系统相关指令
wire                                instr_ebreak;
wire                                instr_ecall;
wire                                instr_dret;
wire                                instr_mret;
wire                                instr_fence;
wire                                instr_fencei;
wire                                instr_wfi;

// load and store相关指令
wire                                instr_lb;
wire                                instr_lbu;
wire                                instr_lh;
wire                                instr_lhu;
wire                                instr_lrw;
wire                                instr_lw;
wire                                instr_scw;
wire                                instr_sb;
wire                                instr_sh;
wire                                instr_sw;

wire                                instr_div;
wire                                instr_divu;
wire                                instr_mul;
wire                                instr_mulh;
wire                                instr_mulhsu;
wire                                instr_mulhu;
wire                                instr_rem;
wire                                instr_remu;

// 不同类型指令的立即数位置不同
wire[31 : 0]                        imm_i_type;
wire[31 : 0]                        imm_i_type_shamt;
wire[31 : 0]                        imm_i_type_csr;
wire[31 : 0]                        imm_b_type_bxx;
wire[31 : 0]                        imm_j_type_jal;
wire[31 : 0]                        imm_s_type;
wire[31 : 0]                        imm_u_type;

wire                                imm_i_type_sel;
wire                                imm_i_type_csr_sel;
wire                                imm_b_type_bxx_sel;
wire                                imm_b_type_jal_sel;
wire                                imm_s_type_sel;
wire                                imm_u_type_sel;

wire[4 : 0]                         rs1;
wire                                rs1_is_0;
wire                                rs1_is_1;
wire                                rs1_not_0;
wire                                rs1_is_31;

wire[4 : 0]                         rs2;
wire                                rs2_is_0;
wire                                rs2_not_0;
wire                                rs2_is_31;

wire[4 : 0]                         rd;
wire                                rd_is_0;
wire                                rd_not_0;
wire                                rd_is_31;

wire[11 : 0]                        csr;

wire                                op_bus_csr_sel;
wire                                amo_op_bus_sel;
wire                                fpu_op_bus_sel;
wire                                op_bus_brch_sel;
wire                                op_bus_lsu_sel;
wire                                op_bus_mdv_sel;
wire                                op_bus_sys_sel;
wire                                op_bus_rglr_sel;

wire[`RGLR_OP_BUS_WIDTH - 1 : 0]    op_bus_rglr;
wire[`BRCH_OP_BUS_WIDTH - 1 : 0]    op_bus_brch;
wire[`SYS_OP_BUS_WIDTH - 1 : 0]     op_bus_sys;
wire[`LSU_OP_BUS_WIDTH - 1 : 0]     op_bus_lsu;
wire[`CSR_OP_BUS_WIDTH - 1 : 0]     op_bus_csr;
wire[`MDV_OP_BUS_WIDTH - 1 : 0]     op_bus_mdv;
wire[`DEC_OP_BUS_WIDTH : 0]         dec_op_bus_mux;

wire                                instr_one_of_rv32_mul;
wire                                instr_one_of_rv32_div;
wire                                instr_one_of_rv32_mdv;

wire                                instr_one_of_load;
wire                                instr_one_of_store;

wire                                ir_all_1_ilegl;
wire                                ir_all_0_ilegl;
wire                                instr_dret_ilegl;
wire                                instr_dret_legl;
wire                                shamt_ilegl;
wire                                instr_sxxi_ilegl;
wire                                support_instr;
wire                                unsupport_instr;

// 首先从指令中解析opcode、funct3以及funct7, 并分类
assign      opcode              = `GET_INSTR_OPCODE(ir);
assign      opcode_is_0110111   = (opcode == 7'b0110111);
assign      opcode_is_0010111   = (opcode == 7'b0010111);
assign      opcode_is_1101111   = (opcode == 7'b1101111);
assign      opcode_is_1100111   = (opcode == 7'b1100111);
assign      opcode_is_1100011   = (opcode == 7'b1100011);
assign      opcode_is_0000011   = (opcode == 7'b0000011);
assign      opcode_is_0100011   = (opcode == 7'b0100011);
assign      opcode_is_0010011   = (opcode == 7'b0010011);
assign      opcode_is_0110011   = (opcode == 7'b0110011);
assign      opcode_is_0001111   = (opcode == 7'b0001111);
assign      opcode_is_1110011   = (opcode == 7'b1110011);
assign      opcode_is_0101111   = (opcode == 7'b0101111);
assign      opcode_is_0000000   = (opcode == 7'b0000000);
assign      opcode_is_1111111   = (opcode == 7'b1111111);

assign      funct3              = `GET_INSTR_FUNCT3(ir);
assign      funct3_bit_0_is_1   = funct3[0];
assign      funct3_bit_0_is_0   = ~funct3_bit_0_is_1;
assign      funct3_bit_1_is_1   = funct3[1];
assign      funct3_bit_1_is_0   = ~funct3_bit_1_is_1;
assign      funct3_bit_2_is_1   = funct3[2];
assign      funct3_bit_2_is_0   = ~funct3_bit_2_is_1;
assign      funct3_is_000       = (funct3 == 3'b000);
assign      funct3_is_001       = (funct3 == 3'b001);
assign      funct3_is_010       = (funct3 == 3'b010);
assign      funct3_is_011       = (funct3 == 3'b011);
assign      funct3_is_100       = (funct3 == 3'b100);
assign      funct3_is_101       = (funct3 == 3'b101);
assign      funct3_is_110       = (funct3 == 3'b110);
assign      funct3_is_111       = (funct3 == 3'b111);

assign      funct7              = `GET_INSTR_FUNCT7(ir);
assign      funct7_is_0000000   = (funct7 == 7'b0000000);
assign      funct7_is_0100000   = (funct7 == 7'b0100000);
assign      funct7_is_0000001   = (funct7 == 7'b0000001);
assign      funct7_is_0001000   = (funct7 == 7'b0001000);
assign      funct7_is_1111111   = (funct7 == 7'b1111111);


// 判断指令类型
assign      instr_u_type =  opcode_is_0110111 |
                            opcode_is_0010111;

assign      instr_j_type =  opcode_is_1101111;

assign      instr_i_type =  opcode_is_1100111 |
                            opcode_is_0000011 |
                            opcode_is_0010011 |
                            opcode_is_0001111 |
                            opcode_is_1110011;

assign      instr_b_type =   opcode_is_1100011;
assign      instr_s_type =   opcode_is_0100011;
assign      instr_r_type =   opcode_is_0110011;

// 乘法和除法译码公共部分
assign      instr_one_of_rv32_mdv = funct7_is_0000001 & opcode_is_0110011;
assign      instr_one_of_rv32_mul = instr_one_of_rv32_mdv & funct3_bit_2_is_0;
assign      instr_one_of_rv32_div = instr_one_of_rv32_mdv & funct3_bit_2_is_1;
assign      instr_one_of_load = opcode_is_0000011;
assign      instr_one_of_store = opcode_is_0100011;

// 提取寄存器索引
assign      rs1 = ir[19 : 15];
assign      rs2 = ir[24 : 20];
assign      rd  = ir[11 : 7];
assign      csr = ir[31 : 20];

assign      rs2_not_0   = |rs2;
assign      rs2_is_0    = ~rs2_not_0;
assign      rs2_is_31   = &rs2;

assign      rs1_not_0   = |rs1;
assign      rs1_is_1    = &{~rs1[4 : 1], rs1[0]};
assign      rs1_is_0    = ~rs1_not_0;
assign      rs1_is_31   = &rs1;

assign      rd_not_0    = |rd;
assign      rd_is_0     = ~rd_not_0;
assign      rd_is_31    = &rd;

/*********************************** 指令立即数解析/选择部分 ****************************************/
/*
    对于U型指令, 需要操作立即数的指令：lui auipc
    J型指令, 只有jal指令需要操作立即数;
    B型指令都需要操作立即数;
    I型指令部分需要操作立即数, 其中slli、srli、srali的立即数与其他指令的位置不一样, 需要单独处理;
    S型
*/
// 从指令中解析出立即数
assign      imm_i_type          = `GET_I_TYPE_IMM(ir);
assign      imm_i_type_shamt    = `GET_I_TYPE_SHAMT(ir);
assign      imm_i_type_csr      = `GET_I_TYPE_ZIMM(ir);
assign      imm_b_type_bxx      = `GET_B_TYPE_BXX_IMM(ir);
assign      imm_j_type_jal      = `GET_J_TYPE_JAL_IMM(ir);
assign      imm_s_type          = `GET_S_TYPE_IMM(ir);
assign      imm_u_type          = `GET_U_TYPE_IMM(ir);


assign      imm_i_type_sel =    opcode_is_0010011  |
                                instr_jalr |
                                opcode_is_0000011;

// csrrci csrrsi csrrwi需要使用zimm
assign      imm_i_type_csr_sel = opcode_is_1110011 &
                                (
                                    funct3_is_101 |
                                    funct3_is_110 |
                                    funct3_is_111
                                );

assign      imm_b_type_bxx_sel = opcode_is_1100011;

assign      imm_b_type_jal_sel = instr_jal;
assign      imm_s_type_sel = opcode_is_0100011;
assign      imm_u_type_sel = instr_lui | instr_auipc;


// 选择立即数输出
assign      dec_imm =   ({32{imm_i_type_sel     }} & imm_i_type         ) |
                        ({32{imm_i_type_csr_sel }} & imm_i_type_csr     ) |
                        ({32{imm_b_type_bxx_sel }} & imm_b_type_bxx     ) |
                        ({32{imm_b_type_jal_sel }} & imm_j_type_jal     ) |
                        ({32{imm_s_type_sel     }} & imm_s_type         ) |
                        ({32{imm_u_type_sel     }} & imm_u_type         );


/*
    add 加, R-Type, RV32I and RV64I,         x[rd] = x[rs1] + x[rs2], 忽略算术溢出
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   000   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_add = opcode_is_0110011 & funct3_is_000 & funct7_is_0000000;

/*
    addi 加立即数, I-Type, RV32I and RV64I,     x[rd] = x[rs1] + sext[imm[11 : 0]];
    加符号位扩展的立即数加到寄存器x[rs1]上, 并将结果写入x[rd], 忽略算术溢出
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   000   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_addi = opcode_is_0010011 & funct3_is_000;

/*
    and 与, R-Type, RV32I and RV64I,                     x[rd] = x[rs1] & x[rs2];
    将寄存器x[rs1]和寄存器x[rs2]位与的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   111   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_and = opcode_is_0110011 & funct3_is_111 & funct7_is_0000000;

/*
    andi 与立即数, I-Type, RV32I and RV64I, x[rd] = x[rs1] & sext(imm[11 : 0]);
    把符号位扩展的立即数和寄存器x[rs1]位与的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   111   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_andi = opcode_is_0010011 & funct3_is_111;

/*
    auipc PC加立即数, U-Type, x[rd] = PC + sext(imm[31 : 12] << 12);
    把符号位扩展的20位(左移12位)立即数加到PC上, 并将结果写入x[rd].
    +--------------------------------------------------------------------------------------------------+
    |31                                                         12|11         7|6                     0|
    +-------------------------------------------------------------+------------+-----------------------+
    |                         imm[31:12]                          |     rd     |        0010111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_auipc = opcode_is_0010111;

/*
    lui 高位立即数加载, U Type, RV32I and RV64I, x[rd] = sext(imm[31 : 12] << 12);
    将符号位扩展的20位立即数imm左移12位, 并将低12位置0, 写入x[rd]中.
    +--------------------------------------------------------------------------------------------------+
    |31                                                         12|11         7|6                     0|
    +-------------------------------------------------------------+------------+-----------------------+
    |                         imm[31:12]                          |     rd     |        0110111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lui = opcode_is_0110111;

/*
    or 或, R-Type, RV32I and RV64I,                     x[rd] = x[rs1] | x[rs2];
    将寄存器x[rs1]和寄存器x[rs2]位或的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   110   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_or = opcode_is_0110011 & funct3_is_110 & funct7_is_0000000;

/*
    ori 立即数或, R-Type, RV32I and RV64I,               x[rd] = x[rs1] | sext(imm);
    将寄存器x[rs1]和寄存器x[rs2]位或的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   110   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_ori = opcode_is_0010011 & funct3_is_110;

/*
    sll    rd, rs1, rs2                                                 x[rd] = x[rs1] << x[rs2]
    逻辑左移 R-Type RV32I and RV64I
    把寄存器x[rs1]左移x[rs2]位, 空出的位置补0, 结果写入x[rd]. x[rs2]的低5位代表移动位数, 高位忽略
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   001   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sll = opcode_is_0110011 & funct3_is_001 & funct7_is_0000000;

/*
    slli    rd, rs1, shamt                                              x[rd] = x[rs1] << shamt
    立即数逻辑左移 R-Type RV32I and RV64I
    把寄存器x[rs1]左移shamt位, 空出的位置补0, 结果写入x[rd]. 对于RV32I, 仅当shamt[5]=0时, 指令才有效
    +--------------------------------------------------------------------------------------------------+
    |31                   26|25         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        000000         |    shamt    |     rs1     |   001   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_slli = opcode_is_0010011 & funct3_is_001 & funct7_is_0000000;

/*
    slt    rd, rs1, rs2                                                 x[rd] = x[rs1] < x[rs2]
    小于则置位    R-Type    RV32I and RV64I
    比较x[rs1]和x[rs2]中的数, 如果x[rs1]更小, 向x[rd]写入1, 否则写入0
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   010   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_slt = opcode_is_0110011 & funct3_is_010 & funct7_is_0000000;

/*
    slti    rd, rs1, imm                                                x[rd] = x[rs1] < sext(imm)
    小于立即数则置位    I-Type RV32I and RV64I
    比较x[rs1]和有符号扩展的立即数, 如果x[rs1]更小, 向x[rd]写入1, 否则写入0
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   010   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_slti = opcode_is_0010011 & funct3_is_010;

/*
    sltiu   rd, rs1, imm                                                x[rd] = x[rs1] < uext(imm)
    无符号小于立即数则置位    I-Type RV32I and RV64I
    比较x[rs1]和零扩展的立即数, 比较时视为无符号数, 如果x[rs1]更小, 向x[rd]写入1, 否则写入0
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   011   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sltiu = opcode_is_0010011 & funct3_is_011;

/*
    sltu    rd, rs1, rs2                                                x[rd] = x[rs1] < x[rs2]
    无符号小于则置位    R-Type    RV32I and RV64I
    比较x[rs1]和x[rs2]中的数, 比较时视为无符号数, 如果x[rs1]更小, 向x[rd]写入1, 否则写入0
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   011   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sltu = opcode_is_0110011 & funct3_is_011 & funct7_is_0000000;

/*
    sra    rd, rs1, rs2                                                 x[rd] = x[rs1] >> x[rs2]
    算术右移 R-Type RV32I and RV64I
    把寄存器x[rs1]右移x[rs2]位, 空位用x[rs1]的最高位填充, 结果写入x[rd]. x[rs2]的低5位代表移动位数, 高位忽略
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0100000        |     rs2     |     rs1     |   101   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sra = opcode_is_0110011 & funct3_is_101 & funct7_is_0100000;

/*
    srai    rd, rs1, shamt                                              x[rd] = x[rs1] >> shamt
    立即数算术右移 R-Type RV32I and RV64I
    把寄存器x[rs1]右移shamt位, 空位用x[rs1]的最高位填充, 结果写入x[rd]. 仅当shamt[5]=0时有效
    +--------------------------------------------------------------------------------------------------+
    |31                   26|25         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        010000         |    shamt    |     rs1     |   101   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_srai = opcode_is_0010011 & funct3_is_101 & funct7_is_0100000;

/*
    srl     rd, rs1, rs2                                                x[rd] = x[rs1] >> x[rs2]
    逻辑右移 R-Type RV32I and RV64I
    把寄存器x[rs1]右移x[rs2]位, 空位用0填充, 结果写入x[rd]. x[rs2]的低5位代表移动位数, 高位忽略
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   101   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_srl = opcode_is_0110011 & funct3_is_101 & funct7_is_0000000;

/*
    srai    rd, rs1, shamt                                              x[rd] = x[rs1] >> shamt
    立即数逻辑右移 R-Type RV32I and RV64I
    把寄存器x[rs1]右移imm位, 空位用0填充, 结果写入x[rd]. 仅当imm[5]=0时有效
    +--------------------------------------------------------------------------------------------------+
    |31                   26|25         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        000000         |    shamt    |     rs1     |   101   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_srli = opcode_is_0010011 & funct3_is_101 & funct7_is_0000000;

/*
    sub     rd, rs1, rs2                                                x[rd] = x[rs1] - x[rs2],
    减, R-Type, RV32I and RV64I
    x[rs1]减去x[rs2], 结果写入x[rd], 忽略算术溢出
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0100000        |     rs2     |     rs1     |   000   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sub = opcode_is_0110011 & funct3_is_000 & funct7_is_0100000;

/*
    xor     rd, rs1, rs2                                                x[rd] = x[rs1] ^ x[rs2]
    异或, R-Type, RV32I and RV64I,
    将寄存器x[rs1]和寄存器x[rs2]异或的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000000        |     rs2     |     rs1     |   100   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_xor = opcode_is_0110011 & funct3_is_100 & funct7_is_0000000;

/*
    xori rd, rs1, imm                                                   x[rd] = x[rs1] ^ sext(imm)
    立即数异或, R-Type, RV32I and RV64I
    将寄存器x[rs1]和寄存器x[rs2]异或的结果写入x[rd]寄存器.
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |               imm[11:0]             |     rs1     |   100   |     rd     |        0010011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_xori = opcode_is_0010011 & funct3_is_100;

/*
    lb      rd, offset(rs1)                                 x[rd] = sext(M[x[rs1] + sext(offset)][7:0])
    字节加载, I-Type RV32I and RV64I
    从地址x[rs1] + sext(offset)处读取一个字节, 经符号位扩展后写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |             offset[11:0]            |     rs1     |   000   |     rd     |        0000011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lb = opcode_is_0000011 & funct3_is_000;

/*
    lbu     rd, offset(rs1)                                 x[rd] = M[x[rs1] + sext(offset)][7:0]
    无符号字节加载, I-Type RV32I and RV64I
    从地址x[rs1] + sext(offset)处读取一个字节, 经零扩展后写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |             offset[11:0]            |     rs1     |   100   |     rd     |        0000011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lbu = opcode_is_0000011 & funct3_is_100;

/*
    lh      rd, offset(rs1)                                 x[rd] = sext(M[x[rs1] + sext(offset)][15:0])
    半字加载, I-Type RV32I and RV64I
    从地址x[rs1] + sext(offset)处读取两个字节, 经符号位扩展后写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |             offset[11:0]            |     rs1     |   001   |     rd     |        0000011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lh = opcode_is_0000011 & funct3_is_001;

/*
    lhu     rd, offset(rs1)                                 x[rd] = M[x[rs1] + sext(offset)][15:0]
    半字加载, I-Type RV32I and RV64I
    从地址x[rs1] + sext(offset)处读取两个字节, 经零扩展后写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |             offset[11:0]            |     rs1     |   101   |     rd     |        0000011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lhu = opcode_is_0000011 & funct3_is_101;

/*
    lw      rd, offset(rs1)                 x[rd] = sext(M[x[rs1] + sext(offset[11 : 0])][31 : 0])
    字加载, I-Type, RV32I and RV64I,
    从地址x[rs1] + sext(offset[11 : 0])读取四个字节, 写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |             offset[11:0]            |     rs1     |   010   |     rd     |        0000011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_lw = opcode_is_0000011 & funct3_is_010;

/*
    sb      rs2, offset(rs1)                M[x[rs1]+ sext(imm)] = x[rs2][7:0]
    存字节    S-Type    RV32I and RV64I
    将x[rs2]的低字节存入内存地址x[rs1] + sext(imm)
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |      offset[11:5]     |     rs2     |     rs1     |   000   | offset[4:0]|        0100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sb = opcode_is_0100011 & funct3_is_000;

/*
    sh    rs2, offset(rs1)                  M[x[rs1]+ sext(imm)] = x[rs2][15:0]
    存半字    S-Type    RV32I and RV64I
    将x[rs2]的低半字存入内存地址x[rs1] + sext(imm)
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |      offset[11:5]     |     rs2     |     rs1     |   000   | offset[4:0]|        0100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sh = opcode_is_0100011 & funct3_is_001;

/*
    sh    rs2, offset(rs1)                  M[x[rs1]+ sext(imm)] = x[rs2]
    存字    S-Type    RV32I and RV64I
    将x[rs2]存入内存地址x[rs1] + sext(imm)
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |      offset[11:5]     |     rs2     |     rs1     |   000   | offset[4:0]|        0100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_sw = opcode_is_0100011 & funct3_is_010;

/*
    beq    rs1, rs2, offset                         if(x[rs1] == x[rs2])    pc += sext(offset)
    相等时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]和寄存器x[rs2]的值相等, 把pc的值设置为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   000   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_beq = opcode_is_1100011 & funct3_is_000;

/*
    bge     rs1, rs2, offset                        if(x[rs1] >= x[rs2])    pc += sext(offset)
    大于等于时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]的值大于等于寄存器x[rs2]的值(均视有有符号数), 把pc的值设置为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   101   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_bge = opcode_is_1100011 & funct3_is_101;

/*
    bgeu    rs1, rs2, offset                        if(x[rs1] >= x[rs2])    pc += sext(offset)
    无符号大于等于时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]的值大于等于寄存器x[rs2]的值(均视为无符号数), 把pc的值设置为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   111   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_bgeu = opcode_is_1100011 & funct3_is_111;

/*
    blt     rs1, rs2, offset                        if(x[rs1] < x[rs2])  pc += sext(offset)
    小于时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]的值小于寄存器x[rs2]的值, 有符号数, 则把pc的值设为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   100   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_blt = opcode_is_1100011 & funct3_is_100;

/*
    bltu    rs1, rs2, offset                        if(x[rs1] < x[rs2])  pc += sext(offset)
    小于时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]的值小于寄存器x[rs2]的值, 无符号数, 则把pc的值设为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   110   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_bltu = opcode_is_1100011 & funct3_is_110;

/*
    bne rs1, rs2, offset                            if(x[rs1] != x[rs2])  pc += sext(offset)
    不相等时分支, B-Type, RV32I and RV64I,
    若寄存器x[rs1]的值不等于寄存器x[rs2]的值, 则把pc的值设为当前值加上符号位扩展的立即数;
    +--------------------------------------------------------------------------------------------------+
    |31                 25|24         20|19         15|14     12|11           7|6                     0|
    +--------------------------------------------------------------------------------------------------+
    |   offset[12|10:5]   |     rs2     |     rs1     |   001   |offset[4:1|11]|        1100011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_bne = opcode_is_1100011 & funct3_is_001;

/*
    jal     rd, offset                              x[rd] = pc + 4; pc += sext(offset)
    跳转并链接 J-Type RV32I and RV64I
    把下一条指令的地址(pc+4), 然后把pc设置为当前值加上符号位扩展的imm,rd默认为x1
    +--------------------------------------------------------------------------------------------------+
    |31                                                         12|11         7|6                     0|
    +-------------------------------------------------------------+------------+-----------------------+
    |                    offset[20|10:1|11|19:12]                 |     rd     |        1101111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_jal = opcode_is_1101111;

/*
    jalr rd, offset(rs1)                            t = pc + 4; pc = (x[rs1] + sext(imm)) & ~1; x[rd] = t
    跳转并链接寄存器 I-Type
    把pc设置为x[rs1] + sext(imm), 把计算出来的地址的最低有效位设为0, 并将原pc+4写入x[rd],rd默认为x1
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |              offset[11:0]           |     rs1     |   010   |     rd     |        1100111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_jalr = opcode_is_1100111 & funct3_is_000;

/*
    fence
    同步内存和IO, 在后续指令中的内存和IO访问对外部（例如其他线程）可见之前, 使这条指令
    之前的内存及IO访问对外部可见, 比特中的第3, 2, 1, 0位分别对应设备输入、设备输出、内存读写.
    例如fence r, rw, 将前面读取与后面的读取和写入排序, 使用pred=0010和succ=0011进行编号.
    如果省略了参数, 则表示fence iorw, iorw, 即对所有访存请求进行排序.
    +--------------------------------------------------------------------------------------------------+
    |31      28|27      24|23      20|19           15|14     12|11            7|6                     0|
    +----------+----------+----------+---------------+---------+---------------+-----------------------+
    |   0000   |   pred   |   succ   |     00000     |   000   |     00000     |        0001111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_fence = opcode_is_0001111 & funct3_is_000;

/*
    fencei
    同步指令流 使内存指令区域的读写, 对后续指令可见
    +--------------------------------------------------------------------------------------------------+
    |31                            20|19           15|14     12|11            7|6                     0|
    +--------------------------------+---------------+---------+---------------+-----------------------+
    |            000000000000        |     00000     |   001   |     00000     |        0001111        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_fencei = opcode_is_0001111 & funct3_is_001;

/*
    mret
    机器模式异常返回    R-Type RV32I and RV64I特权架构
    从机器模式异常处理程序返回, 将pc设置为CSRs[mepc], 将特权级设置为CSRs[mstatus].MPP,
    CSRs[msatus].MIE设置为CSRs[mstatus].MPIE, 并且将CSRs[mstatus].MPIE设置为1；并且,
    如果支持用户模式, 则将CSRs[mstatus].MPP设置为0
    +--------------------------------------------------------------------------------------------------+
    |31                  25|24           20|19     15|14     12|11            7|6                     0|
    +----------------------+---------------+---------+---------+---------------+-----------------------+
    |        0011000       |     00010     |  00000  |   000   |     00000     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_mret = (ir[31 : 20] == 12'b0011_0000_0010) & funct3_is_000 & opcode_is_1110011;

/*
    dret 调试模式返回
*/
assign      instr_dret = (ir[31 : 20] == 12'b0111_1011_0010) & funct3_is_000 & opcode_is_1110011;

/*
    csrrc                       t = CSRs[csr]; CSRs[csr] = t & (~x[rs1]); x[rd] = t
    读后清除控制状态寄存器,
    记控制状态寄存器csr中的值为t, 把t和寄存器x[rs1]按位与的结果写入csr, 两把t写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |     rs1     |   011   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrc = opcode_is_1110011 & funct3_is_011;

/*
    csrrci                      t = CSRs[csr]; CSRs[csr] = t & (~zimm); x[rd] = t
    立即数读后清除控制状态寄存器,
    记控制状态寄存器csr中的值为t, 把t和和五位零扩展的立即数zimm拉位与的结果写入csr, 再把t
    写入x[rd](csr寄存器的第五位及更高位不娈)
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |  zimm[4:0]  |   111   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrci = opcode_is_1110011 & funct3_is_111;

/*
    csrrs                       t = CSRs[csr]; CSRs[csr] = t | x[rs1]; x[rd] = t
    读后置位控制状态寄存器,
    记控制状态寄存器csr中的值为t, 把t和寄存器x[rs1]按位或的结果写入csr, 两把t写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |     rs1     |   010   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrs = opcode_is_1110011 & funct3_is_010;

/*
    csrrsi                      t = CSRs[csr]; CSRs[csr] = t | zimm; x[rd] = t
    立即数读设置控制状态寄存器,
    记控制状态寄存器csr中的值为t, 把t和和五位零扩展的立即数zimm拉位或的结果写入csr, 再把t
    写入x[rd](csr寄存器的第五位及更高位不娈)
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |  zimm[4:0]  |   110   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrsi = opcode_is_1110011 & funct3_is_110;

/*
    csrrw                       t = CSRs[csr]; CSRs[csr] = x[rs1]; x[rd] = t
    读后写控制状态寄存器,
    记控制状态寄存器csr中的值为t, 把寄存器x[rs1]的值写入csr, 再把t写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |     rs1     |   001   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrw = opcode_is_1110011 & funct3_is_001;

/*
    csrrwi                      x[rd] = CSRs[csr];CSRs[csr] = zimm
    立即数读后写控制状态寄存器,
    把控制状态寄存器csr中的值写入x[rd], 再把五位的零扩展的立即数zimm的值写入csr
    +--------------------------------------------------------------------------------------------------+
    |31                                 20|19         15|14     12|11         7|6                     0|
    +-------------------------------------+-------------+---------+------------+-----------------------+
    |                csr                  |  zimm[4:0]  |   101   |     rd     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_csrrwi = opcode_is_1110011 & funct3_is_101;

/*
    ebreak
    环境断点, 通过抛出断点异常的方式请求调试器
    +--------------------------------------------------------------------------------------------------+
    |31                            20|19           15|14     12|11            7|6                     0|
    +--------------------------------+---------------+---------+---------------+-----------------------+
    |          000000000001          |     00000     |   000   |     00000     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_ebreak = (ir[31 : 20] == 12'b0000_0000_0001) & funct3_is_000 & opcode_is_1110011;

/*
    ebreak
    环境调用, 通过引发环境异常的方式请求调试器
    +--------------------------------------------------------------------------------------------------+
    |31                            20|19           15|14     12|11            7|6                     0|
    +--------------------------------+---------------+---------+---------------+-----------------------+
    |        000000000000            |     00000     |   000   |     00000     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_ecall = (ir[31 : 20] == 12'b0000_0000_0000) & funct3_is_000 & opcode_is_1110011;

/*
    wfi
    特权指令, 等待中断, 如果没有待处理的中断, 则将处理器置为空闲状态
    +--------------------------------------------------------------------------------------------------+
    |31                25|24           20|19       15|14     12|11            7|6                     0|
    +--------------------+---------------+-----------+---------+---------------+-----------------------+
    |       0001000      |     00101     |   00000   |   000   |     00000     |        1110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_wfi = funct7_is_0001000 & funct3_is_000 & opcode_is_1110011;

/*
    div     rd, rs1, rs2                            x[rd] = x[rs1] / x[rs2]
    除法 R-Type, Rv32M and RV64M,
    用寄存器x[rs1]的值除以寄存器x[rs2]的值, 向零舍入, 将这些数视为二进制补码, 把商写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   100   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_div = instr_one_of_rv32_div & funct3_bit_1_is_0 & funct3_bit_0_is_0;

/*
    divu    rd, rs1, rs2                            x[rd] = x[rs1] / x[rs2]
    无符号除法 R-Type, Rv32M and RV64M,
    用寄存器x[rs1]的值除以寄存器x[rs2]的值, 向零舍入, 将这些数视为无符号数, 把商写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   101   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_divu = instr_one_of_rv32_div & funct3_bit_1_is_0 & funct3_bit_0_is_1;

/*
    mul     rd, rs1, rs2                            x[rd] = x[rs1] * x[rs2]
    乘 R-Type RV32I and RV64I,
    把寄存器x[rs1]与寄存器x[rs2]的乘积写入x[rd], 忽略算术溢出
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   000   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_mul = instr_one_of_rv32_mul & funct3_bit_1_is_0 & funct3_bit_0_is_0;

/*
    mulh    rd, rs1, rs2                            x[rd] = x[rs1] * x[rs2] >> 32
    高位乘 R-Type RV32I and RV64I,
    将寄存器x[rs1]与寄存器x[rs2]相乘, x[rs1]、x[rs2]都视为二进制补码, 将乘积的高位写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   001   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_mulh = instr_one_of_rv32_mul & funct3_bit_1_is_0 & funct3_bit_0_is_1;

/*
    mulhsu  rd, rs1, rs2                            x[rd] = x[rs1] * x[rs2] >> XLEN
    高位乘 R-Type RV32I and RV64I,
    将寄存器x[rs1]与寄存器x[rs2]相乘, x[rs1]为二进制补码, x[rs2]为无符号数, 将乘积的高位
    写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   010   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_mulhsu = instr_one_of_rv32_mul & funct3_bit_1_is_1 & funct3_bit_0_is_0;

/*
    mulhu   rd, rs1, rs2                            x[rd] = x[rs1] * x[rs2] >> XLEN
    高位无符号乘 R-Type RV32I and RV64I,
    将寄存器x[rs1]与寄存器x[rs2]相乘, x[rs1]、x[rs2]都视为无符号数, 将乘积的高位写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   011   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_mulhu = instr_one_of_rv32_mul & funct3_bit_1_is_1 & funct3_bit_0_is_1;

/*
    rem    rd, rs1, rs2                             x[rd] = x[rs1] % x[rs2]
    求余数 R-Type RV32I and RV64I,
    x[rs1]除以x[rs2], 向0舍入, 都视为二进制数, 余数写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   110   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_rem = instr_one_of_rv32_div & funct3_bit_1_is_1 & funct3_bit_0_is_0;

/*
    rem    rd, rs1, rs2                             x[rd] = x[rs1] % x[rs2]
    求无符号的余数 R-Type RV32I and RV64I,
    x[rs1]除以x[rs2], 向0舍入, 都视为无符号数, 余数写入x[rd]
    +--------------------------------------------------------------------------------------------------+
    |31                   25|24         20|19         15|14     12|11         7|6                     0|
    +-----------------------+-------------+-------------+---------+------------+-----------------------+
    |        0000001        |     rs2     |     rs1     |   111   |     rd     |        0110011        |
    +--------------------------------------------------------------------------------------------------+
*/
assign      instr_remu = instr_one_of_rv32_div & funct3_bit_1_is_1 & funct3_bit_0_is_1;


/* 将指令分为以下几类
    1、常规运算指令, 包含:
        add addi auipc sub and andi or ori xor xori lui sll slli slt slti sltu sltiu sra srai srl srli
    2、分支指令, 包含:
        beq bge bgeu blt bltu bne jal jalr mret dret
    3、系统相关指令, 包含:
        ebreak ecall fence fencei wfi csrrc csrrci csrrw csrrwi csrrs csrrsi
    4、lsu指令, 需要访存, 包含:
        lb lbu lh lhu lw sb sh sw
    5、乘除法指令, 包含:
        div divu mul mulh mulhsu mulhu rem remu
*/
// ===========================================================================
//                                      常规运算指令
// ===========================================================================
assign      op_bus_rglr[`RGLR_ADD_LOC]      = instr_add | instr_addi;
assign      op_bus_rglr[`RGLR_SUB_LOC]      = instr_sub;
assign      op_bus_rglr[`RGLR_AND_LOC]      = instr_and | instr_andi;
assign      op_bus_rglr[`RGLR_OR_LOC]       = instr_or | instr_ori;
assign      op_bus_rglr[`RGLR_XOR_LOC]      = instr_xor | instr_xori;
assign      op_bus_rglr[`RGLR_SLL_LOC]      = instr_sll | instr_slli;
assign      op_bus_rglr[`RGLR_SLT_LOC]      = instr_slt | instr_slti;
assign      op_bus_rglr[`RGLR_SRA_LOC]      = instr_sra | instr_srai;
assign      op_bus_rglr[`RGLR_SRL_LOC]      = instr_srl | instr_srli;
assign      op_bus_rglr[`RGLR_AUIPC_LOC]    = instr_auipc;
assign      op_bus_rglr[`RGLR_LUI_LOC]      = instr_lui;
assign      op_bus_rglr[`RGLR_SLTU_LOC]     = instr_sltu | instr_sltiu;
assign      op_bus_rglr[`RGLR_OP1_IS_PC]    = instr_auipc;
assign      op_bus_rglr[`RGLR_OP2_IS_IMM]   = instr_i_type | instr_u_type;

// ===========================================================================
//                                      访存指令
// ===========================================================================
assign      op_bus_lsu[`LSU_LOAD_LOC]   = instr_lb | instr_lh | instr_lw | instr_lbu | instr_lhu;
assign      op_bus_lsu[`LSU_STORE_LOC]  = instr_sb | instr_sh | instr_sw;
assign      op_bus_lsu[`LSU_SIZE_LOC]   =   (instr_lb | instr_lbu | instr_sb) ?  2'd0 :
                                            (instr_lh | instr_lhu | instr_sh) ? 2'd1 :
                                            2'd2;
//  lbu指令和lhu指令需要无符号扩展，我们这里只判断funct3，不判断opcode，因为如果不是访存指令，
//  我们这里拉高也没有问题，最终也不会选择lus_op_bus作为译码结果
assign      op_bus_lsu[`LSU_SEXT_LOC]   = ~(funct3_is_100 | funct3_is_101);

// ===========================================================================
//                                      分支指令
// ===========================================================================
assign      op_bus_brch[`BRCH_BEQ_LOC]      = instr_beq;
assign      op_bus_brch[`BRCH_BGE_LOC]      = instr_bge;
assign      op_bus_brch[`BRCH_BGEU_LOC]     = instr_bgeu;
assign      op_bus_brch[`BRCH_BLT_LOC]      = instr_blt;
assign      op_bus_brch[`BRCH_BLTU_LOC]     = instr_bltu;
assign      op_bus_brch[`BRCH_BNE_LOC]      = instr_bne;
assign      op_bus_brch[`BRCH_JAL_LOC]      = instr_jal;
assign      op_bus_brch[`BRCH_JALR_LOC]     = instr_jalr;
assign      op_bus_brch[`BRCH_MRET_LOC]     = instr_mret;
assign      op_bus_brch[`BRCH_DRET_LOC]     = instr_dret;
assign      op_bus_brch[`BRCH_FENCE_LOC]    = instr_fence | instr_fencei;
assign      op_bus_brch[`BRCH_OP1_IS_PC]    = instr_jal | instr_jalr;
assign      op_bus_brch[`BRCH_OP2_IS_IMM]   = instr_jal | instr_jalr;

// ===========================================================================
//                                      CSR指令
// ===========================================================================
assign      op_bus_csr[`CSR_CSRRC_LOC]      = instr_csrrc | instr_csrrci;
assign      op_bus_csr[`CSR_CSRRS_LOC]      = instr_csrrs | instr_csrrsi;
assign      op_bus_csr[`CSR_CSRRW_LOC]      = instr_csrrw | instr_csrrwi;
assign      op_bus_csr[`CSR_OP1_IS_ZERO]    = rs1_is_0;
assign      op_bus_csr[`CSR_OP2_IS_IMM]     = instr_csrrci | instr_csrrsi | instr_csrrwi;

// ===========================================================================
//                                      系统相关指令
// ===========================================================================
assign      op_bus_sys[`SYS_WFI_LOC]        = instr_wfi;
assign      op_bus_sys[`SYS_EBREAK_LOC]     = instr_ebreak;
assign      op_bus_sys[`SYS_ECALL_LOC]      = instr_ecall;

// ===========================================================================
//                                      整数乘除指令
// ===========================================================================
assign      op_bus_mdv[`MDV_DIV_LOC]            = instr_one_of_rv32_div;
assign      op_bus_mdv[`MDV_MUL_LOC]            = instr_one_of_rv32_mul;
assign      op_bus_mdv[`MDV_OP1_SIGNED_LOC]     = op_bus_mdv[`MDV_OP2_SIGNED_LOC] | instr_mulhsu;
assign      op_bus_mdv[`MDV_OP2_SIGNED_LOC]     = instr_div | instr_rem | instr_mul | instr_mulh;
assign      op_bus_mdv[`MDV_RES_HIGH_LOC]       = instr_mulh | instr_mulhsu | instr_mulhu | instr_rem | instr_remu;

// ===========================================================================
//                                      原子指令
// ===========================================================================

// ===========================================================================
//                                      浮点运算指令
// ===========================================================================


// 选出一个译码信息, 由于OP_BUS_WIDTH使用的是各个OP_BUS_WIDTH中最大的那个, 如果直接使用OP_BUS_WIDTH - RGLR_OP_BUS_WIDTH,
// 有可能出现{0{1'b0}}的情况, 为了避免这个情况发生, 我们将op_bus_mux的位宽定义为OP_BUS_WIDTH+1, 这样可以保证相减后至少为1,
// 只需要在输出的时候忽略最高位即可.
assign      op_bus_rglr_sel =   opcode_is_0010011 |
                                (opcode_is_0110011 & (~funct7_is_0000001)) |     //opcode == 0110011 且 funct7 == 0000001时, 为乘除法指令
                                instr_lui |
                                instr_auipc;

assign      op_bus_lsu_sel = instr_one_of_load | instr_one_of_store;

assign      op_bus_brch_sel =   opcode_is_1100011 |
                                instr_jal |
                                instr_jalr |
                                instr_mret |
                                instr_fencei | instr_fence |
                                instr_dret_legl;

assign      op_bus_csr_sel = opcode_is_1110011 & (~funct3_is_000);

assign      op_bus_sys_sel = instr_wfi | instr_ebreak | instr_ecall;

assign      op_bus_mdv_sel = instr_one_of_rv32_mdv;

assign      amo_op_bus_sel = 1'b0;

assign      fpu_op_bus_sel = 1'b0;

assign      dec_op_bus_mux =    ({(`DEC_OP_BUS_WIDTH + 1){op_bus_rglr_sel}} & {{(`DEC_OP_BUS_WIDTH + 1 - `RGLR_OP_BUS_WIDTH){1'b0}},    op_bus_rglr}) |
                                ({(`DEC_OP_BUS_WIDTH + 1){op_bus_brch_sel}} & {{(`DEC_OP_BUS_WIDTH + 1 - `BRCH_OP_BUS_WIDTH){1'b0}},    op_bus_brch}) |
                                ({(`DEC_OP_BUS_WIDTH + 1){op_bus_lsu_sel}}  & {{(`DEC_OP_BUS_WIDTH + 1 - `LSU_OP_BUS_WIDTH){1'b0}},     op_bus_lsu}) |
                                ({(`DEC_OP_BUS_WIDTH + 1){op_bus_csr_sel}}  & {{(`DEC_OP_BUS_WIDTH + 1 - `CSR_OP_BUS_WIDTH){1'b0}},     op_bus_csr}) |
                                ({(`DEC_OP_BUS_WIDTH + 1){op_bus_sys_sel}}  & {{(`DEC_OP_BUS_WIDTH + 1 - `SYS_OP_BUS_WIDTH){1'b0}},     op_bus_sys}) |
                                ({(`DEC_OP_BUS_WIDTH + 1){op_bus_mdv_sel}}  & {{(`DEC_OP_BUS_WIDTH + 1 - `MDV_OP_BUS_WIDTH){1'b0}},     op_bus_mdv});

assign      dec_op_bus = dec_op_bus_mux[0 +: `DEC_OP_BUS_WIDTH];
assign      dec_op_type =   op_bus_rglr_sel ? `DEC_RGLR_BUS :
                            op_bus_brch_sel ? `DEC_BRCH_BUS :
                            op_bus_lsu_sel ? `DEC_LSU_BUS :
                            op_bus_csr_sel ? `DEC_CSR_BUS :
                            op_bus_sys_sel ? `DEC_SYS_BUS :
                            op_bus_mdv_sel ? `DEC_MDV_BUS :
                            `DEC_NONE_BUS;

// 判断非法指令
// shamt只有在比特5为0的情况下才有效
assign      shamt_ilegl = imm_i_type_shamt[5];
assign      instr_sxxi_ilegl = shamt_ilegl & (instr_srai | instr_srli | instr_slli);

// dret指令只在debug mode下才可以使用
assign      instr_dret_ilegl = instr_dret & (~d_mode);
assign      instr_dret_legl = instr_dret & d_mode;

// 已经支持的指令
assign      support_instr =     op_bus_rglr_sel |
                                op_bus_sys_sel |
                                op_bus_brch_sel |
                                op_bus_lsu_sel |
                                op_bus_mdv_sel |
                                fpu_op_bus_sel |
                                op_bus_csr_sel |
                                amo_op_bus_sel |
                                1'b0;
assign      unsupport_instr = ~support_instr;

assign      ir_all_0_ilegl = opcode_is_0000000 & rd_is_0 & funct3_is_000 & rs1_is_0 & rs2_is_0 & funct7_is_0000000;
assign      ir_all_1_ilegl = opcode_is_1111111 & rd_is_31 & funct3_is_111 & rs1_is_31 & rs2_is_31 & funct7_is_1111111;

// 非法指令
assign      dec_ilegl_ir =  unsupport_instr |
                            instr_sxxi_ilegl |
                            instr_dret_ilegl |
                            ir_all_0_ilegl |
                            ir_all_1_ilegl;

// 寄存器索引
assign      dec_rs1 = rs1;
assign      dec_rs2 = rs2;
assign      dec_rd  = rd;
assign      dec_csr = csr;


assign      dec_ir_bxx = instr_b_type;
assign      dec_ir_jal = instr_jal;
assign      dec_ir_jalr = instr_jalr;
assign      dec_ir_fence = instr_fence | instr_fencei;

assign      dec_imm_bxx = imm_b_type_bxx;
assign      dec_imm_jal = imm_j_type_jal;
assign      dec_imm_jalr = imm_i_type;

assign      dec_rs1_x1 = rs1_is_1;

endmodule